[
    {
        "id": 1,
        "title": "Why Does Hisoka Morow Love Power So Much?",
        "excerpt": "In any community, especially our own at STEM High School for Boys – 6th of October, leadership is a powerful force. This philosophical exploration delves into the complex psychology behind leadership aspirations, examining how personal insecurities, societal expectations, and the desire for validation can transform genuine leadership into a performative pursuit of power.",
        "author": "Yaseen Mohamed-Abdelal",
        "date": "April 7, 2025",
        "readTime": "15 min read",
        "category": "Leadership",
        "image": "https://pm1.aminoapps.com/7274/9e178fdd43ec8a8e4d690b7500e153fa708f9d88r1-571-472v2_hq.jpg",
        "featured": true,
        "color": "accent-purple",
        "content": "In any community, especially our own at *STEM High School for Boys – 6th of October*, leadership is a powerful force. We see students aspiring to lead everywhere – in non-profit teams, in clubs, on student councils, or even in capstone teams, whether to make a real impact, stand out. Some are drawn to the *idea* of leadership, seeking its *aura* without necessarily embracing its responsibilities, others see it as a strategic step for boosting college applications. Yet, beneath these varied aspirations, a critical question remains unasked: *How do we truly understand and value leadership? What hidden needs does it sometimes fill within us? How does one's perception of themselves and others shift when they gain influence, seemingly convinced they are now at the center of the universe?*\n\n## The CHARACTER:\n\nFor this discussion, we'll explore these dynamics through the lens of **Hisoka Morow**—a fictional character from HunterxHunter, chosen to embody certain qualities and behaviors associated with leadership.\n\n## The MASK:\n\nHisoka, at first, was simply another student among his peers—talkative, witty, but all in all, just an ordinary guy, yet deep down; beneath that charm, there's more. Deep inside, Hisoka was uncertain of himself. They might feel good, but never truly the best; smart, but never the smartest. Gifted, but never truly exceptional. They felt like they were always one step behind the people who naturally stood out, and that feeling kept eating him from the inside out.\n\nHisoka, despite his achievements, constantly feels overlooked or not quite *enough* in academic discussions. They might crave recognition, not for the joy of contribution, but to silence that nagging doubt. So, when a leadership opportunity arises–perhaps a club presidency or a project lead–they see it as their golden ticket, believing the title itself will finally make them feel secure and respected.\n\nFor them, leadership becomes more than just a role; it's a **mask**. It's a way to hide his insecurities, to compensate for perceived weaknesses, and to project an illusion of competence. They truly believe that if others see them as powerful, they will finally feel secure. *But does this external power, this title, ever truly fill that internal void?*\n\n*\"This approach treats leadership as a facade, a means to cover internal doubts rather than a genuine commitment to service.\"*\n\n## The LEADERBOARD:\n\nHisoka views school life as a grand, competitive **leaderboard**. Every club, every committee, every position wasn't just an opportunity to serve, but a rank to be climbed, a score to be displayed. He saw the entire student body as a hierarchy where a title signifies success. For them, leadership isn't about the work; it's about the *win*, about having the highest score. They might see the President of the Student Council not as a facilitator of student voice, but as the player with the most points. They *believe* that being at the top of this perceived leaderboard is the ultimate measure of worth.\n\nThis mentality shifted his entire worldview. The moment he stepped into a leadership position, it was as if something inside him switched. The way he spoke changed. The way he looked at people shifted. Those who were once his equals were now beneath him, and he made sure they felt it. One day, when asked if he was attending an event, Hisoka smiled and declared, \"I am going, but not like you. I will go as an upper hand, as a leader.\" His tone made it clear—he saw us as beneath him now. This wasn't about attending an event; it was about proving that he was different, that he was somehow above the rest of us on the \"board.\"\n\nAnother time, when friends needed information about an upcoming school initiative that Hisoka, now in the \"leadership circle,\" had access to, he smirked and said, \"This info is for the leaders only. You guys don't really need to know, and if you need, you will know with the rest of the people.\" It wasn't just about withholding information—it was the way he said it, as if those without a title weren't worth his consideration. For Hisoka, control over information was another badge on his personal leaderboard, a demonstration of his elevated status, as if you need to have a higher score in his virtual leaderboard to access such information.\n\nThese were not isolated incidents. Hisoka's conversations became self-centered, only engaging if the topic involved his personal achievements, his leadership role, or his \"importance.\" If the discussion didn't revolve around his perceived successes, he was disinterested. His ego inflated, not from genuine growth or contribution, but from the mere acquisition of a title. The leadership position, in his mind, had boosted his rank, solidifying an illusion of superiority. The same people he used to hang out with now felt like extras in a story where he was the main character. He wasn't exactly chasing power for its own sake, but once he got it, he treated people differently—only respecting those who could potentially benefit his own climb up the metaphorical leaderboard. *But will Hisoka finally reach the top of his leaderboard?*\n\n*\"This approach mirrors a 'leaderboard' mentality, where the goal is to climb the ranks and gain status, much like in an app or game, rather than to genuinely contribute.\"*\n\n## The SPOTLIGHT:\n\nHisoka was always drawn to the loudest applause, the brightest lights. Even as a regular student, he found ways to make sure his voice was heard, his ideas acknowledged, often dominating group discussions or volunteering for public presentations. They thrived on the attention, the fleeting moments when all eyes were on them. But it was never truly about the project; it was about the audience. When a leadership role became available, like leading the school's summer camp, Hisoka didn't see it as a chance to organize a great event for his peers. He saw it as the ultimate stage. He imagined himself at the flag and all the sophomores circling around him asking him for help, he saw it as the chance to put him inside the **spotlight**.\n\nFor them, leadership wasn't about guiding; it was about **being seen**, about being admired, about having all eyes on them. The title was merely the spotlight operator, ensuring they were always illuminated. They would volunteer for tasks that offered maximum visibility, even if they weren't the most impactful or necessary. During meetings, they would steer conversations back to their contributions, ensuring their name was associated with every success. If someone else received praise, they would subtly interject with their own role in the achievement, diverting the attention back to themself. This constant need for validation, for the glow of the spotlight, meant that the true purpose of leadership—serving others—was overshadowed by their insatiable hunger for personal recognition. *But can true leadership ever flourish when its primary motivation is the applause of the crowd?*\n\n*\"This perspective views leadership as a stage for personal acclaim, where the desire for attention eclipses the actual work of guiding and serving.\"*\n\n## The MINISTER:\n\nThere was a time when a group project was spiraling out of control, and Hisoka, though not the actual leader, quickly stepped in. But his \"help\" wasn't collaborative. He didn't ask for ideas; he dictated tasks. He didn't facilitate discussion; he issued commands. If someone suggested an alternative, he would dismiss it with a dismissive wave or a sharp retort, asserting his way as the only way. He believed that only through his strict guidance could chaos be averted.\n\nWhen he finally gained an official leadership position, this tendency intensified. For Hisoka, leadership wasn't about empowering a team; it was about **exerting absolute control, like being the minister**, about ensuring that every piece moved exactly as he commanded. He micro-managed every detail, insisted on approving every decision, and grew visibly agitated if anyone deviated from his precise instructions. He viewed delegation not as trust, but as a necessary evil to be managed with an iron fist. He would withhold information he deemed \"unnecessary\" for others to know, or change plans at the last minute without consultation, all to maintain his grip on every aspect of the project. He believed that if he could control everything, he could control his own anxieties and the unpredictable nature of the world around him. But in doing so, he stifled creativity, eroded trust, and ultimately, alienated those he was supposed to lead. But does his approach of controlling everyone and everything actually expand the impact or just limit it more?\n\n*\"This mentality transforms leadership into a tool for dominance, prioritizing rigid control over collaboration and empowerment, ultimately hindering true progress.\"*\n\n## Leadership as an Outcast's Pursuit:\n\nBut here's the fundamental flaw, the specific \"bug\" in Hisoka's understanding that mocks the actual meaning of leadership: even after securing his leadership position, *did he feel truly fulfilled? Did he finally feel like he had proven himself? Or did he just keep chasing more, because deep down, the insecurity never left, the leaderboard always had another higher rank to achieve, the spotlight could always shine brighter, and there was always something more to control?*\n\nThis is the heartbreaking truth: **leadership, when seen as a mask for insecurity, a game for status, a stage for personal glory, or a means of absolute control, inevitably makes the \"leader\" an outcast**. Hisoka, in his relentless pursuit of titles, validation, attention, and dominance, distanced himself from genuine connection. He alienated those who once cared for him, transforming friendships into transactional relationships based on perceived utility. His focus on self-importance, his need for control, and his hunger for the spotlight made him incapable of truly listening, empathizing, or collaborating—the very cornerstones of effective leadership. He became isolated on his self-constructed pedestal, respected (if at all) for his position, but not for his character or his true impact.\n\nTrue leaders don't need titles to feel worthy. They don't need to prove their value by stepping on others or holding information. They don't see their peers as competitors or rungs on a ladder. Instead, they lead because they want to help, to empower others, to contribute to something larger than themselves. They understand that leadership isn't a solitary ascent to the top of an \"apps leadership board,\" nor is it a personal performance or a means to dominate. It is a shared journey where genuine connection, service, and collaboration create lasting impact. When leadership becomes about self-gratification—whether to hide insecurities, climb a social ladder, bask in the spotlight.\n\nSo, the question for us, and for characters like Hisoka, remains:\n\n*\"Does one lead because they are truly capable and committed to a cause, or do they lead because, without the title, they feel like they are not enough?\"*"
    },
    {
        "id": 2,
        "title": "When Did Lamperouge's Story Stopped Being His?",
        "excerpt": "The doors of Room 18, the quick tap-tap of keyboards, the harsh glow of the computer screen, the quite talks about \"high grades\", \"perfect scores\", \"must-have activities\", and \"alumni connections\"—this is the everyday soundtrack of senior year at STEM High School for Boys – 6th of October. In this race to shine, a quiet, yet uneasy question sits in the back of our minds: When does the story we tell about ourselves stop being truly ours?",
        "author": "Yaseen Mohamed-Abdelal",
        "date": "July 31, 2025",
        "readTime": "20 min read",
        "category": "Student Life",
        "image": "https://tse4.mm.bing.net/th/id/OIP.iORnCPMV3_O8Pw75Ki5ESAHaEo?rs=1&pid=ImgDetMain&o=7&rm=3",
        "featured": false,
        "color": "accent-blue",
        "content": "The doors of Room 18, the quick tap-tap of keyboards, the harsh glow of the computer screen, the quite talks about \"high grades\", \"perfect scores\", \"must-have activities\", and \"alumni connections\"—this is the everyday soundtrack of senior year at STEM High School for Boys – 6th of October. For many, the path to college feels less like a personal journey and more like a big show, a carefully planned performance meant to impress people we've never met before. We hear it everywhere: \"Stand out!\" \"Be unique!\" \"Tell your story!\" But in this race to shine, a quiet, yet uneasy question sits in the back of our minds: *When does the story we tell about ourselves stop being truly ours? When do we start making up a version of ourselves, a fake story, just for an application, losing who we really are behind the shiny outside?*\n\nStudents approach this challenge in so many ways. Some fake or stretch the truth. Others fix their real lives to fit the perfect picture. And then there are those who just pour their hearts into real work, only to find it doesn't quite \"fit\" the tiny boxes on an application. And in the middle, some try to walk a fine line, balancing true passion with smart choices. Let's dig into these different paths and what they mean for who we become. This journey is often complicated by the unpredictable nature of university admissions and the false belief that college acceptance is the ultimate key to success.\n\n**NOTE: Every example mentioned latter in the article is just for illustration purposes and it doesn't cause any harm to any club, organization or a person**\n\n## The CHARACTER:\n\nFor this discussion, we'll look at these ideas through the eyes of **Lelouch Lamperouge** from Code Geass. On the outside, Lelouch is just a smart, quiet high school student, seemingly bored by the world's problems. He's often seen playing chess, a sign of his sharp mind and how he thinks many steps ahead. But hidden deep behind this calm student is Zero, a masked leader who sets out to change the world. Lelouch is a genius not just because he's smart, but because he's unbelievably good at creating and maintaining a public image that completely hides his real self and secret plans. Every move he makes, every word he says in public, is part of the \"Zero\" story he wants the world to believe.\n\n## The ECHOES:\n\nBefore we even begin to craft our own \"story,\" we're bombarded by a thousand voices telling us what that story should be. This isn't just about direct commands; it's a subtle, constant hum that shapes our idea of what \"success\" looks like. From counselors who mean well but share stories of \"successful\" older students who \"did everything right,\" to whatsapp groups gently pushing \"prestigious\" extracurriculars that seem to guarantee admission, to the constant online chatter about \"what colleges are looking for\"—a shared idea of the perfect applicant starts to form. . We see the polished online profiles of alumni, the social media posts of students volunteering far away, the news stories about \"well-rounded\" young stars. The pressure isn't just to be good, but to be visibly good in a very specific way.\n\nThis creates a *powerful echo chamber* of expectation, a silent pressure to fit an ideal student mold. You might genuinely love coding old video games, spending hours building complex worlds, but feel a heavy weight to join the Pioneer because your junior says, \"Colleges love Research.\" Or perhaps you're passionate about rapping, but your school's culture pushes you towards STEM Fields and Olympiads. The tiny seed of not being real often sprouts here, not out of malice, but from a desperate hope to meet these unspoken rules and grab a secure future. We start to believe that our true interests aren't \"enough,\" and that our self-worth is tied to this external, idealized image.\n\n This echo chamber also distorts how we view outcomes. When a student gets accepted to a highly selective university, they're often instantly seen as a \"hero\"—their every action, every activity, every essay is deemed \"perfect.\" On the flip side, a brilliant student, perhaps a top performer academically and deeply involved in activities, who doesn't get accepted, is often quietly judged. Society whispers that they \"must have done something wrong\" or weren't \"professional enough\" in their application. This creates a halo effect for the accepted, where their advice is blindly trusted, and their essays are seen as the gold standard, even if the difference was just luck or a subjective fit. This philosophical distortion makes us question: Is success truly measured by external validation, or by the integrity of our efforts? \n\n*\"This world quietly pushes students to follow an outside story, caring more about what looks good than what they truly feel or want to do.\"*\n\n## The FAKESELF:\n\nImagine Lelouch Lamperouge, not as a rebel leader, but as a high school student meticulously planning his college applications. He knows the \"story\" on paper is everything—a strategic document, like a chess match where every move is calculated. He doesn't just study; he makes sure his study habits are seen. He always attends all the sessions, always asks the \"right\" questions in class, even if he already knows the answer. He doesn't just join in; he carefully plans his involvement to make his grades and recommendation letters look perfect.\n\nThink about the \"passion project.\" Lelouch might spend hours writing a flawless essay about \"founding\" a \"non-profit impactful initiative.\" In truth, it was just a few hurried meetings with friends, and a nicely designed logo and website that he barely marketed. Or perhaps he claims a \"leadership role\" in the school's Chess Club, detailing his \"strategic contributions\" and \"team motivation,\" even if the club didn't start, mentally calculating his next move in his real life, not the club's. Another example: a student might claim to have conducted \"independent research\" when they merely compiled existing data from online sources, or took an existing research and just applied it in the STEM Community, presenting it as original work. The goal isn't genuine achievement; it's the idea of it—a strong, convincing story, even if it's built on shaky ground, even if it isn't yourself, but your *fakeself*. The inner struggle is a nagging whisper: \"This isn't true.\" But it's drowned out by the belief that the perfect story is a necessary step, a means to an end. He tells himself it's okay, just as Lelouch tells himself his actions as Zero are justified—a difficult choice needed for a bigger goal.\n\n*\"This way of acting turns real experiences into a planned show, where the story of success hides the truth of the journey.\"*\n\n## The CHECKLIST:\n\nLelouch, ever the cold strategist, wouldn't join a club out of pure interest or a wish to help. He'd pick activities because they \"look good\" on his application. Maybe it's the Farming Club, or even the Capstone Support Team. He'd show up just enough to get his name on the list, to collect a signature. He wouldn't truly care about the cause or connect with anyone. He might sit through the capstone sessions, bored, skimming the portfolios, staring at his phone, counting the minutes until he could leave without anyone notice he did nothing. All the while, he'd be mentally writing down how he'd phrase his \"dedication\" and \"impact\" to post it on LinkedIn.\n\nThis isn't about real passion; it's about checking boxes on the **Checklist**, gathering impressive-sounding bullet points, and creating a profile that screams \"well-rounded\" without any real depth. The emptiness of these experiences becomes a quiet, heavy burden. A student might volunteer at Resala or Life Makers, not because they love helping others, but because it fulfills a \"service hours\" rule. They go through the motions, feeling a dull ache of disinterest, while dreaming of the glowing letter of recommendation. These are missed chances for real growth, for finding true passions, all given up for the sake of the application.\n\nThis also applies to roles like \"mentorship.\" Some students become \"mentors\" just for the title on their application, without truly guiding or supporting anyone. Their \"mentorship\" might mean showing up for a quick photo, or one making one or two sessions, just to add that impressive line to their resume. Lelouch, focused on powerful labels and how they can be used, would understand this well—the strength of a title, even if the real meaning is thin. The philosophy here is that the label becomes more valuable than the labor.\n\n*\"This way of thinking turns real involvement into just a list to check off, caring more about outside approval than true interest and meaningful work.\"*\n\n## The TRUTHFUL:\n\nBut what about the students who aren't trying to fake anything at all? Imagine a student who spends years quietly working on a complex personal coding project, building an app that genuinely helps their local community, or dedicating countless hours to tutoring younger students in a subject they deeply love, without a formal program or title. Another might be the backbone of their family, helping with younger siblings, working a part or even a full-time job to contribute financially, or caring for an ailing relative, gaining immense life skills and responsibility. These are profound experiences of growth, resilience, and contribution. Yet, their work might be truly impactful, changing lives or advancing knowledge, yet it might be *truthful* for them, but it doesn't fit neatly into a \"leadership role\" or a \"national competition\" box on an application. Their passion is real, their effort immense, but their efforts might not \"look as good\" on the application compared to a flashier, less substantial activity.\n\nConsider the student who spends every weekend volunteering at an animal shelter, cleaning cages and comforting scared animals, but has no \"leadership title\" to show for it. Or the aspiring writer who crafts a novel in their spare time, a deeply personal and creative endeavor, but finds no category for \"independent authorship\" on the application. Lelouch, focused on strategic outcomes and visible power, might see these students as inefficient. Why spend so much time on something that doesn't yield a clear, marketable \"point\" for the application? He might respect their dedication, but ultimately view their purity of purpose as naive in the \"college game.\" Yet, it is precisely this genuine, unmeasured impact that often forms the true core of contribution, demonstrating deep character and intrinsic motivation, even if it remains unseen by the admissions committee.\n\n*\"This path values true contribution and deep learning, often unseen by outside eyes, challenging the idea that impact must be 'marketable' to matter.\"*\n\n## The NAVIGATOR:\n\nThen there are students who try to *navigate* a middle path. They understand the \"college game\" but refuse to completely give up who they really are. They might join a club they genuinely like, then learn how to clearly explain their real contributions and growth in a way that sounds good on applications. For instance, a student truly passionate about environmental science might start a small, local recycling drive, then learn how to frame their initiative's impact in terms of \"community engagement\" and \"project management\" for their essay, highlighting their genuine passion while speaking the language of admissions. Or they choose activities that align with their interests and happen to have clear, measurable results that look good on paper, like joining a competition in a subject they love, allowing them to pursue their passion within a structured, recognized framework.\n\nThey might engage in \"strategic authenticity\"—identifying genuine interests that also happen to have strong application appeal. For example, a student who loves creative writing might also join the school's forum—self marketing rizz, ensuring their passion has a visible, structured outlet and a clear role. Another might turn their passion for gaming into organizing an e-sports tournament, demonstrating leadership and organizational skills. Another student, who is truly passionate about computer science might dedicate hours in the Hack Club's YSWSs, showcasing not just their technical skills but also having some gifts, a good recognizable activity, and for sure, doing their own passion. This approach demands constant self-awareness and a strong sense of personal values to make sure the strategy doesn't slowly hide their true self. It's a delicate balance, a walk between ambition and authenticity, but can we truly play the game without becoming part of the game's illusion, without letting the system define our true selves?\n\n*\"This approach aims for harmony between real passion and smart presentation, seeking to honor one's true self while handling outside expectations and application demands.\"*\n\n## The Real Price: Losing Your Own Voice\n\nThe deepest and most hidden problem with this made-up story is that you slowly lose who you really are. Like Lelouch, who gets more and more lost in his Zero role until his real self is almost gone, students who live this application-driven lie can lose touch with their true selves. The constant act, the nagging fear of being found out, and the inner split between who they pretend to be and who they truly are can lead to deep worry, constant stress, and feeling completely worn out. It's a profound identity crisis, a quiet unraveling of who you thought you were.\n\nImagine the empty feeling of getting into your dream university, only to realize that the person who got in isn't truly you, but the carefully built fake. The first joy fades, replaced by a quiet fear, a sense of being an impostor. You arrive at college, only to find you can't truly connect with others because your \"real self\" was hidden for so long that you don't know who you are anymore. You might have picked a major because it \"looked good,\" only to find you have no real interest in it, feeling trapped by a choice made by your past, fake self. The fear of being \"found out\" do esn't end with getting in; it changes into the fear of being seen as a fake in college, leading to a constant feeling of not belonging, lost in a future built on someone else's hopes. This is the real sadness: winning the race, but losing yourself along the way. The question here is: what value is a victory if it costs you your very self, leaving you a stranger in your own life, perpetually performing a role you no longer recognize?\n\nThe dangers of the made-up story are clear: a life lived just for an application is a life half-lived, a story told by someone else. It's a show that, while it might open doors, can leave you standing alone in a room you don't recognize, with a self you no longer own. While the pressure to impress colleges is real, the true, lasting value isn't in a perfect, shiny fake, but in the messy, real, and changing truth of who you are. Your unique experiences, your true passions, and your honest struggles are far more interesting and lasting than any made-up fake.\n\nIt's time to take back your story. This means more than just being honest on an application; it means truly knowing yourself. Think about what really excites you, do things because you genuinely like them, even if they don't seem \"impressive.\" Trust that your unique, honest self—with all its quirks, real passions, and true experiences—is your greatest strength. The most powerful stories are not those carefully built for outside approval, but those lived with honesty and passion, letting you walk into any future confident in who you truly are.\n\nSo, the question for us, and for characters like Lelouch Lamperouge, remains:\n\n*\"Does the story you're telling about yourself truly belong to you, or has it become a carefully built fake for the world's approval?\"*"
    }
]